app/Models/commande_model.php

    public static function get_utilisateur($id_utilisateur){
        $db = \Config\Database::connect();
        $builder = $db->table('utilisateur');
        $builder->select('*');
        $builder->where('id_utilisateur', $id_utilisateur);
        $query = $builder->get();
---
SELECT *
FROM `utilisateur`
WHERE `id_utilisateur` = '1'

    public static function get_id_utilisateur_connexion($username){
        $db = \Config\Database::connect();
        $builder = $db->table('utilisateur');
        $builder->select('id_utilisateur');
        $builder->where('username', $username);
        $query = $builder->get();
---
SELECT `id_utilisateur`
FROM `utilisateur`
WHERE `username` = 'YJ6QXb4G'

    public static function get_admin($id_admin){
        $db = \Config\Database::connect();
        $builder = $db->table('admin');
        $builder->select('*');
        $builder->where('id_admin', $id_admin);
        $query = $builder->get();
---
SELECT *
FROM `admin`
WHERE `id_admin` = '1'

    public static function get_id_admin_connexion($username){
        $db = \Config\Database::connect();
        $builder = $db->table('admin');
        $builder->select('id_admin');
        $builder->where('username_admin', $username);
        $query = $builder->get();
---
SELECT `id_admin`
FROM `admin`
WHERE `username_admin` = 'YJ6QXb4G'

    public function get_Allcommande($id_utilisateur){
        $db = \Config\Database::connect();
        $builder = $db->table('article');
        $builder->select('*');
        $builder->join('client', 'client.id_client = article.id_client');
        $builder->where('client.id_utilisateur', $id_utilisateur);
        $query = $builder->get();
---
SELECT *
FROM `article`
JOIN `client` ON `client`.`id_client` = `article`.`id_client`
WHERE `client`.`id_utilisateur` = '1'

    public static function get_id_client($id_utilisateur){
        $db = \Config\Database::connect();
        $builder = $db->table('client');
        $builder->select('*');
        $builder->where('id_client', $id_utilisateur);
        $query = $builder->get();
---
SELECT *
FROM `client`
WHERE `id_client` = '1'

public static function insert_article($id_utilisateur, $societe)
{
    $db = \Config\Database::connect();
    $id_client_obj = self::get_id_client($id_utilisateur);
    $id_client = $id_client_obj->id_client; // Supposons que 'id_client' est la propriété contenant l'ID client

    // Récupérer les données de la table Excel
    $builder_excel = $db->table('excel');
    $query_excel = $builder_excel->get();
    $excel_data = $query_excel->getResult();

    // Parcourir les données de la table Excel
    foreach ($excel_data as $row) {
        // Vérifier si la société correspond à celle passée en paramètre
        if ($societe == $row->Societe) {
            // Vérifier si l'article existe déjà dans la base de données
            $article_exists = $db->table('article')
                                ->where('Numpiece', $row->Numpiece)
                                ->countAllResults() > 0;

            // Si l'article n'existe pas encore, l'insérer
            if (!$article_exists) {
                // Insérer les données dans la table Article
                $result = $db->table('article')->insert([
                    'Typedepiece' => $row->Typedepiece,
                    'Numpiece' => $row->Numpiece,
                    'Client' => $row->Client,
                    'Refcde' => $row->Refcde,
                    'Date_piece' => $row->Date_piece,
                    'Indice' => $row->Indice,
                    'Soldee' => $row->Soldee,
                    'Article' => $row->Article,
                    'Designationcourte' => $row->Designationcourte,
                    'Description' => $row->Description,
                    'PrixUniHTrem' => $row->PrixUniHTrem,
                    'Qte' => $row->Qte,
                    'MtTotH' => $row->MtTotH,
                    'Observations' => $row->Observations,
                    'Famille' => $row->Famille,
                    'Qteparcolis' => $row->Qteparcolis,
                    'QteLivree' => $row->QteLivree,
                    'Referencefournisseur' => $row->Referencefournisseur,
                    'Remarque' => $row->Remarque,
                    'Ref' => $row->Ref,
---
SELECT *
FROM `excel`
SELECT COUNT(*) AS `numrows`
FROM `article`
WHERE `Numpiece` = 'CD23-04551'
INSERT INTO `article` (`Typedepiece`, `Numpiece`, `Client`, `Refcde`, `Date_piece`, `Indice`, `Soldee`, `Article`, `Designationcourte`, `Description`, `PrixUniHTrem`, `Qte`, `MtTotH`, `Observations`, `Famille`, `Qteparcolis`, `QteLivree`, `Referencefournisseur`, `Remarque`, `Ref`, `Representant`, `Societe`, `Datepiece2`, `Typedepiece2`, `Numpiece2`, `mail`, `id_client`) VALUES ('Commande', 'CD23-04551', '0120', '4803133040', '2023-08-01', '1', 'Vrai', '01770064863DES', 'KITS - HP LASERJET P2055D', 'KITS - HP LASERJET P2055D ARTICLE N° :  01770064863 / N° SERIE :  VNC3F51669 -> RECU UNE HP P2055d A LA PLACE D\'UNE HP PRO 401DN -> E/S PATIN + FLIM FOUR + Nettoyage Complet + TESTS OK - FORFAIT  ', '70.000', '1.000', '70.00  EUR', 'QUOC - REPONSE RECUE LE 02/08/2023 - ATT. INSTRUCTIONS CLIENT  - VOIR PHOTOS EN P.J. -> RECU UNE HP P2055d A LA PLACE D\'UNE HP PRO 401DN', 'NIXDORF ', '', '1.000', '', 'VNC3F51669', 'CD23-04551 ->>> CD23-04823   *18 PCES', '0002', 'DIEBOLD NIXDORF Global ', '2023-08-14', 'Bon de livraison', 'BL23-01794', 'yanislaldjipro@gmail.com', '1')